__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 128, 128, 21) 0                                            
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 128, 128, 21) 0           input_1[0][0]                    
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 128, 128, 128 2816        input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 128, 128, 64) 12160       input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 128, 128, 32) 16832       input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 128, 128, 32) 704         max_pooling2d[0][0]              
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 128, 128, 256 0           conv2d[0][0]                     
                                                                 conv2d_1[0][0]                   
                                                                 conv2d_2[0][0]                   
                                                                 conv2d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 32, 32, 256)  0           concatenate[0][0]                
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 32, 32, 32)   8224        max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 32, 32, 32)   8224        max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 32, 32, 256)  0           max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 32, 32, 128)  32896       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 32, 32, 64)   18496       conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 32, 32, 32)   25632       conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 32, 32, 32)   8224        max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 32, 32, 256)  65792       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 32, 32, 256)  0           conv2d_6[0][0]                   
                                                                 conv2d_7[0][0]                   
                                                                 conv2d_8[0][0]                   
                                                                 conv2d_9[0][0]                   
__________________________________________________________________________________________________
add (Add)                       (None, 32, 32, 256)  0           conv2d_10[0][0]                  
                                                                 concatenate_1[0][0]              
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 10, 10, 256)  0           add[0][0]                        
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 10, 10, 32)   8224        max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 10, 10, 32)   8224        max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 10, 10, 256)  0           max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 10, 10, 128)  32896       max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 10, 10, 64)   18496       conv2d_11[0][0]                  
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 10, 10, 32)   25632       conv2d_12[0][0]                  
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 10, 10, 32)   8224        max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 10, 10, 256)  65792       max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 10, 10, 256)  0           conv2d_13[0][0]                  
                                                                 conv2d_14[0][0]                  
                                                                 conv2d_15[0][0]                  
                                                                 conv2d_16[0][0]                  
__________________________________________________________________________________________________
add_1 (Add)                     (None, 10, 10, 256)  0           conv2d_17[0][0]                  
                                                                 concatenate_2[0][0]              
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 3, 3, 256)    0           add_1[0][0]                      
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 3, 3, 64)     16448       max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 3, 3, 64)     16448       max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 3, 3, 256)    0           max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 3, 3, 128)    32896       max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 3, 3, 64)     36928       conv2d_18[0][0]                  
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 3, 3, 32)     51232       conv2d_19[0][0]                  
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 3, 3, 32)     8224        max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 3, 3, 256)    65792       max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 3, 3, 256)    0           conv2d_20[0][0]                  
                                                                 conv2d_21[0][0]                  
                                                                 conv2d_22[0][0]                  
                                                                 conv2d_23[0][0]                  
__________________________________________________________________________________________________
add_2 (Add)                     (None, 3, 3, 256)    0           conv2d_24[0][0]                  
                                                                 concatenate_3[0][0]              
__________________________________________________________________________________________________
max_pooling2d_7 (MaxPooling2D)  (None, 1, 1, 256)    0           add_2[0][0]                      
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 1, 1, 64)     16448       max_pooling2d_7[0][0]            
==================================================================================================
Total params: 611,904
Trainable params: 611,904
Non-trainable params: 0
__________________________________________________________________________________________________
