__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_3 (InputLayer)            (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_4 (InputLayer)            (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_5 (InputLayer)            (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_6 (InputLayer)            (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_7 (InputLayer)            (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_8 (InputLayer)            (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_9 (InputLayer)            (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_10 (InputLayer)           (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_11 (InputLayer)           (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_12 (InputLayer)           (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_13 (InputLayer)           (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_14 (InputLayer)           (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_15 (InputLayer)           (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_16 (InputLayer)           (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_17 (InputLayer)           (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_18 (InputLayer)           (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_19 (InputLayer)           (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_20 (InputLayer)           (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_21 (InputLayer)           (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_22 (InputLayer)           (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_23 (InputLayer)           (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_24 (InputLayer)           (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_25 (InputLayer)           (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
parallel (Model)                (None, 2, 2, 64)     408384      input_2[0][0]                    
                                                                 input_3[0][0]                    
                                                                 input_4[0][0]                    
                                                                 input_5[0][0]                    
                                                                 input_6[0][0]                    
                                                                 input_7[0][0]                    
                                                                 input_8[0][0]                    
                                                                 input_9[0][0]                    
                                                                 input_10[0][0]                   
                                                                 input_11[0][0]                   
                                                                 input_12[0][0]                   
                                                                 input_13[0][0]                   
                                                                 input_14[0][0]                   
                                                                 input_15[0][0]                   
                                                                 input_16[0][0]                   
                                                                 input_17[0][0]                   
                                                                 input_18[0][0]                   
                                                                 input_19[0][0]                   
                                                                 input_20[0][0]                   
                                                                 input_21[0][0]                   
                                                                 input_22[0][0]                   
                                                                 input_23[0][0]                   
                                                                 input_24[0][0]                   
                                                                 input_25[0][0]                   
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 48, 2, 64)    0           parallel[1][0]                   
                                                                 parallel[2][0]                   
                                                                 parallel[3][0]                   
                                                                 parallel[4][0]                   
                                                                 parallel[5][0]                   
                                                                 parallel[6][0]                   
                                                                 parallel[7][0]                   
                                                                 parallel[8][0]                   
                                                                 parallel[9][0]                   
                                                                 parallel[10][0]                  
                                                                 parallel[11][0]                  
                                                                 parallel[12][0]                  
                                                                 parallel[13][0]                  
                                                                 parallel[14][0]                  
                                                                 parallel[15][0]                  
                                                                 parallel[16][0]                  
                                                                 parallel[17][0]                  
                                                                 parallel[18][0]                  
                                                                 parallel[19][0]                  
                                                                 parallel[20][0]                  
                                                                 parallel[21][0]                  
                                                                 parallel[22][0]                  
                                                                 parallel[23][0]                  
                                                                 parallel[24][0]                  
__________________________________________________________________________________________________
flatten (Flatten)               (None, 6144)         0           concatenate_4[0][0]              
__________________________________________________________________________________________________
dense (Dense)                   (None, 100)          614500      flatten[0][0]                    
__________________________________________________________________________________________________
dropout (Dropout)               (None, 100)          0           dense[0][0]                      
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 50)           5050        dropout[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 50)           0           dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 3)            153         dropout_1[0][0]                  
==================================================================================================
Total params: 1,028,087
Trainable params: 1,028,087
Non-trainable params: 0
__________________________________________________________________________________________________
