__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_3 (InputLayer)            (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_4 (InputLayer)            (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_5 (InputLayer)            (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_6 (InputLayer)            (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_7 (InputLayer)            (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_8 (InputLayer)            (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_9 (InputLayer)            (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_10 (InputLayer)           (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_11 (InputLayer)           (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_12 (InputLayer)           (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_13 (InputLayer)           (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_14 (InputLayer)           (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_15 (InputLayer)           (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_16 (InputLayer)           (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_17 (InputLayer)           (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_18 (InputLayer)           (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_19 (InputLayer)           (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_20 (InputLayer)           (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_21 (InputLayer)           (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_22 (InputLayer)           (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_23 (InputLayer)           (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
input_24 (InputLayer)           (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 128, 128, 32) 4928        input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 128, 128, 32) 4928        input_2[0][0]                    
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 128, 128, 32) 4928        input_3[0][0]                    
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 128, 128, 32) 4928        input_4[0][0]                    
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 128, 128, 32) 4928        input_5[0][0]                    
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 128, 128, 32) 4928        input_6[0][0]                    
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 128, 128, 32) 4928        input_7[0][0]                    
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 128, 128, 32) 4928        input_8[0][0]                    
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 128, 128, 32) 4928        input_9[0][0]                    
__________________________________________________________________________________________________
conv2d_36 (Conv2D)              (None, 128, 128, 32) 4928        input_10[0][0]                   
__________________________________________________________________________________________________
conv2d_40 (Conv2D)              (None, 128, 128, 32) 4928        input_11[0][0]                   
__________________________________________________________________________________________________
conv2d_44 (Conv2D)              (None, 128, 128, 32) 4928        input_12[0][0]                   
__________________________________________________________________________________________________
conv2d_48 (Conv2D)              (None, 128, 128, 32) 4928        input_13[0][0]                   
__________________________________________________________________________________________________
conv2d_52 (Conv2D)              (None, 128, 128, 32) 4928        input_14[0][0]                   
__________________________________________________________________________________________________
conv2d_56 (Conv2D)              (None, 128, 128, 32) 4928        input_15[0][0]                   
__________________________________________________________________________________________________
conv2d_60 (Conv2D)              (None, 128, 128, 32) 4928        input_16[0][0]                   
__________________________________________________________________________________________________
conv2d_64 (Conv2D)              (None, 128, 128, 32) 4928        input_17[0][0]                   
__________________________________________________________________________________________________
conv2d_68 (Conv2D)              (None, 128, 128, 32) 4928        input_18[0][0]                   
__________________________________________________________________________________________________
conv2d_72 (Conv2D)              (None, 128, 128, 32) 4928        input_19[0][0]                   
__________________________________________________________________________________________________
conv2d_76 (Conv2D)              (None, 128, 128, 32) 4928        input_20[0][0]                   
__________________________________________________________________________________________________
conv2d_80 (Conv2D)              (None, 128, 128, 32) 4928        input_21[0][0]                   
__________________________________________________________________________________________________
conv2d_84 (Conv2D)              (None, 128, 128, 32) 4928        input_22[0][0]                   
__________________________________________________________________________________________________
conv2d_88 (Conv2D)              (None, 128, 128, 32) 4928        input_23[0][0]                   
__________________________________________________________________________________________________
conv2d_92 (Conv2D)              (None, 128, 128, 32) 4928        input_24[0][0]                   
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 32, 32, 32)   0           conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 32, 32, 32)   0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_8 (MaxPooling2D)  (None, 32, 32, 32)   0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_12 (MaxPooling2D) (None, 32, 32, 32)   0           conv2d_12[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_16 (MaxPooling2D) (None, 32, 32, 32)   0           conv2d_16[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_20 (MaxPooling2D) (None, 32, 32, 32)   0           conv2d_20[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_24 (MaxPooling2D) (None, 32, 32, 32)   0           conv2d_24[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_28 (MaxPooling2D) (None, 32, 32, 32)   0           conv2d_28[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_32 (MaxPooling2D) (None, 32, 32, 32)   0           conv2d_32[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_36 (MaxPooling2D) (None, 32, 32, 32)   0           conv2d_36[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_40 (MaxPooling2D) (None, 32, 32, 32)   0           conv2d_40[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_44 (MaxPooling2D) (None, 32, 32, 32)   0           conv2d_44[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_48 (MaxPooling2D) (None, 32, 32, 32)   0           conv2d_48[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_52 (MaxPooling2D) (None, 32, 32, 32)   0           conv2d_52[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_56 (MaxPooling2D) (None, 32, 32, 32)   0           conv2d_56[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_60 (MaxPooling2D) (None, 32, 32, 32)   0           conv2d_60[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_64 (MaxPooling2D) (None, 32, 32, 32)   0           conv2d_64[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_68 (MaxPooling2D) (None, 32, 32, 32)   0           conv2d_68[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_72 (MaxPooling2D) (None, 32, 32, 32)   0           conv2d_72[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_76 (MaxPooling2D) (None, 32, 32, 32)   0           conv2d_76[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_80 (MaxPooling2D) (None, 32, 32, 32)   0           conv2d_80[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_84 (MaxPooling2D) (None, 32, 32, 32)   0           conv2d_84[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_88 (MaxPooling2D) (None, 32, 32, 32)   0           conv2d_88[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_92 (MaxPooling2D) (None, 32, 32, 32)   0           conv2d_92[0][0]                  
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 32, 32, 32)   9248        max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 32, 32, 32)   9248        max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 32, 32, 32)   9248        max_pooling2d_8[0][0]            
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 32, 32, 32)   9248        max_pooling2d_12[0][0]           
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 32, 32, 32)   9248        max_pooling2d_16[0][0]           
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 32, 32, 32)   9248        max_pooling2d_20[0][0]           
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 32, 32, 32)   9248        max_pooling2d_24[0][0]           
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 32, 32, 32)   9248        max_pooling2d_28[0][0]           
__________________________________________________________________________________________________
conv2d_33 (Conv2D)              (None, 32, 32, 32)   9248        max_pooling2d_32[0][0]           
__________________________________________________________________________________________________
conv2d_37 (Conv2D)              (None, 32, 32, 32)   9248        max_pooling2d_36[0][0]           
__________________________________________________________________________________________________
conv2d_41 (Conv2D)              (None, 32, 32, 32)   9248        max_pooling2d_40[0][0]           
__________________________________________________________________________________________________
conv2d_45 (Conv2D)              (None, 32, 32, 32)   9248        max_pooling2d_44[0][0]           
__________________________________________________________________________________________________
conv2d_49 (Conv2D)              (None, 32, 32, 32)   9248        max_pooling2d_48[0][0]           
__________________________________________________________________________________________________
conv2d_53 (Conv2D)              (None, 32, 32, 32)   9248        max_pooling2d_52[0][0]           
__________________________________________________________________________________________________
conv2d_57 (Conv2D)              (None, 32, 32, 32)   9248        max_pooling2d_56[0][0]           
__________________________________________________________________________________________________
conv2d_61 (Conv2D)              (None, 32, 32, 32)   9248        max_pooling2d_60[0][0]           
__________________________________________________________________________________________________
conv2d_65 (Conv2D)              (None, 32, 32, 32)   9248        max_pooling2d_64[0][0]           
__________________________________________________________________________________________________
conv2d_69 (Conv2D)              (None, 32, 32, 32)   9248        max_pooling2d_68[0][0]           
__________________________________________________________________________________________________
conv2d_73 (Conv2D)              (None, 32, 32, 32)   9248        max_pooling2d_72[0][0]           
__________________________________________________________________________________________________
conv2d_77 (Conv2D)              (None, 32, 32, 32)   9248        max_pooling2d_76[0][0]           
__________________________________________________________________________________________________
conv2d_81 (Conv2D)              (None, 32, 32, 32)   9248        max_pooling2d_80[0][0]           
__________________________________________________________________________________________________
conv2d_85 (Conv2D)              (None, 32, 32, 32)   9248        max_pooling2d_84[0][0]           
__________________________________________________________________________________________________
conv2d_89 (Conv2D)              (None, 32, 32, 32)   9248        max_pooling2d_88[0][0]           
__________________________________________________________________________________________________
conv2d_93 (Conv2D)              (None, 32, 32, 32)   9248        max_pooling2d_92[0][0]           
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 16, 16, 32)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 16, 16, 32)   0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_9 (MaxPooling2D)  (None, 16, 16, 32)   0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_13 (MaxPooling2D) (None, 16, 16, 32)   0           conv2d_13[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_17 (MaxPooling2D) (None, 16, 16, 32)   0           conv2d_17[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_21 (MaxPooling2D) (None, 16, 16, 32)   0           conv2d_21[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_25 (MaxPooling2D) (None, 16, 16, 32)   0           conv2d_25[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_29 (MaxPooling2D) (None, 16, 16, 32)   0           conv2d_29[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_33 (MaxPooling2D) (None, 16, 16, 32)   0           conv2d_33[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_37 (MaxPooling2D) (None, 16, 16, 32)   0           conv2d_37[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_41 (MaxPooling2D) (None, 16, 16, 32)   0           conv2d_41[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_45 (MaxPooling2D) (None, 16, 16, 32)   0           conv2d_45[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_49 (MaxPooling2D) (None, 16, 16, 32)   0           conv2d_49[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_53 (MaxPooling2D) (None, 16, 16, 32)   0           conv2d_53[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_57 (MaxPooling2D) (None, 16, 16, 32)   0           conv2d_57[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_61 (MaxPooling2D) (None, 16, 16, 32)   0           conv2d_61[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_65 (MaxPooling2D) (None, 16, 16, 32)   0           conv2d_65[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_69 (MaxPooling2D) (None, 16, 16, 32)   0           conv2d_69[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_73 (MaxPooling2D) (None, 16, 16, 32)   0           conv2d_73[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_77 (MaxPooling2D) (None, 16, 16, 32)   0           conv2d_77[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_81 (MaxPooling2D) (None, 16, 16, 32)   0           conv2d_81[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_85 (MaxPooling2D) (None, 16, 16, 32)   0           conv2d_85[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_89 (MaxPooling2D) (None, 16, 16, 32)   0           conv2d_89[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_93 (MaxPooling2D) (None, 16, 16, 32)   0           conv2d_93[0][0]                  
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 16, 16, 64)   18496       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 16, 16, 64)   18496       max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 16, 16, 64)   18496       max_pooling2d_9[0][0]            
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 16, 16, 64)   18496       max_pooling2d_13[0][0]           
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 16, 16, 64)   18496       max_pooling2d_17[0][0]           
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 16, 16, 64)   18496       max_pooling2d_21[0][0]           
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 16, 16, 64)   18496       max_pooling2d_25[0][0]           
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 16, 16, 64)   18496       max_pooling2d_29[0][0]           
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, 16, 16, 64)   18496       max_pooling2d_33[0][0]           
__________________________________________________________________________________________________
conv2d_38 (Conv2D)              (None, 16, 16, 64)   18496       max_pooling2d_37[0][0]           
__________________________________________________________________________________________________
conv2d_42 (Conv2D)              (None, 16, 16, 64)   18496       max_pooling2d_41[0][0]           
__________________________________________________________________________________________________
conv2d_46 (Conv2D)              (None, 16, 16, 64)   18496       max_pooling2d_45[0][0]           
__________________________________________________________________________________________________
conv2d_50 (Conv2D)              (None, 16, 16, 64)   18496       max_pooling2d_49[0][0]           
__________________________________________________________________________________________________
conv2d_54 (Conv2D)              (None, 16, 16, 64)   18496       max_pooling2d_53[0][0]           
__________________________________________________________________________________________________
conv2d_58 (Conv2D)              (None, 16, 16, 64)   18496       max_pooling2d_57[0][0]           
__________________________________________________________________________________________________
conv2d_62 (Conv2D)              (None, 16, 16, 64)   18496       max_pooling2d_61[0][0]           
__________________________________________________________________________________________________
conv2d_66 (Conv2D)              (None, 16, 16, 64)   18496       max_pooling2d_65[0][0]           
__________________________________________________________________________________________________
conv2d_70 (Conv2D)              (None, 16, 16, 64)   18496       max_pooling2d_69[0][0]           
__________________________________________________________________________________________________
conv2d_74 (Conv2D)              (None, 16, 16, 64)   18496       max_pooling2d_73[0][0]           
__________________________________________________________________________________________________
conv2d_78 (Conv2D)              (None, 16, 16, 64)   18496       max_pooling2d_77[0][0]           
__________________________________________________________________________________________________
conv2d_82 (Conv2D)              (None, 16, 16, 64)   18496       max_pooling2d_81[0][0]           
__________________________________________________________________________________________________
conv2d_86 (Conv2D)              (None, 16, 16, 64)   18496       max_pooling2d_85[0][0]           
__________________________________________________________________________________________________
conv2d_90 (Conv2D)              (None, 16, 16, 64)   18496       max_pooling2d_89[0][0]           
__________________________________________________________________________________________________
conv2d_94 (Conv2D)              (None, 16, 16, 64)   18496       max_pooling2d_93[0][0]           
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 8, 8, 64)     0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 8, 8, 64)     0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_10 (MaxPooling2D) (None, 8, 8, 64)     0           conv2d_10[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_14 (MaxPooling2D) (None, 8, 8, 64)     0           conv2d_14[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_18 (MaxPooling2D) (None, 8, 8, 64)     0           conv2d_18[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_22 (MaxPooling2D) (None, 8, 8, 64)     0           conv2d_22[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_26 (MaxPooling2D) (None, 8, 8, 64)     0           conv2d_26[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_30 (MaxPooling2D) (None, 8, 8, 64)     0           conv2d_30[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_34 (MaxPooling2D) (None, 8, 8, 64)     0           conv2d_34[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_38 (MaxPooling2D) (None, 8, 8, 64)     0           conv2d_38[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_42 (MaxPooling2D) (None, 8, 8, 64)     0           conv2d_42[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_46 (MaxPooling2D) (None, 8, 8, 64)     0           conv2d_46[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_50 (MaxPooling2D) (None, 8, 8, 64)     0           conv2d_50[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_54 (MaxPooling2D) (None, 8, 8, 64)     0           conv2d_54[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_58 (MaxPooling2D) (None, 8, 8, 64)     0           conv2d_58[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_62 (MaxPooling2D) (None, 8, 8, 64)     0           conv2d_62[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_66 (MaxPooling2D) (None, 8, 8, 64)     0           conv2d_66[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_70 (MaxPooling2D) (None, 8, 8, 64)     0           conv2d_70[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_74 (MaxPooling2D) (None, 8, 8, 64)     0           conv2d_74[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_78 (MaxPooling2D) (None, 8, 8, 64)     0           conv2d_78[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_82 (MaxPooling2D) (None, 8, 8, 64)     0           conv2d_82[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_86 (MaxPooling2D) (None, 8, 8, 64)     0           conv2d_86[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_90 (MaxPooling2D) (None, 8, 8, 64)     0           conv2d_90[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_94 (MaxPooling2D) (None, 8, 8, 64)     0           conv2d_94[0][0]                  
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 8, 8, 64)     36928       max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 8, 8, 64)     36928       max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 8, 8, 64)     36928       max_pooling2d_10[0][0]           
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 8, 8, 64)     36928       max_pooling2d_14[0][0]           
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 8, 8, 64)     36928       max_pooling2d_18[0][0]           
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 8, 8, 64)     36928       max_pooling2d_22[0][0]           
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 8, 8, 64)     36928       max_pooling2d_26[0][0]           
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 8, 8, 64)     36928       max_pooling2d_30[0][0]           
__________________________________________________________________________________________________
conv2d_35 (Conv2D)              (None, 8, 8, 64)     36928       max_pooling2d_34[0][0]           
__________________________________________________________________________________________________
conv2d_39 (Conv2D)              (None, 8, 8, 64)     36928       max_pooling2d_38[0][0]           
__________________________________________________________________________________________________
conv2d_43 (Conv2D)              (None, 8, 8, 64)     36928       max_pooling2d_42[0][0]           
__________________________________________________________________________________________________
conv2d_47 (Conv2D)              (None, 8, 8, 64)     36928       max_pooling2d_46[0][0]           
__________________________________________________________________________________________________
conv2d_51 (Conv2D)              (None, 8, 8, 64)     36928       max_pooling2d_50[0][0]           
__________________________________________________________________________________________________
conv2d_55 (Conv2D)              (None, 8, 8, 64)     36928       max_pooling2d_54[0][0]           
__________________________________________________________________________________________________
conv2d_59 (Conv2D)              (None, 8, 8, 64)     36928       max_pooling2d_58[0][0]           
__________________________________________________________________________________________________
conv2d_63 (Conv2D)              (None, 8, 8, 64)     36928       max_pooling2d_62[0][0]           
__________________________________________________________________________________________________
conv2d_67 (Conv2D)              (None, 8, 8, 64)     36928       max_pooling2d_66[0][0]           
__________________________________________________________________________________________________
conv2d_71 (Conv2D)              (None, 8, 8, 64)     36928       max_pooling2d_70[0][0]           
__________________________________________________________________________________________________
conv2d_75 (Conv2D)              (None, 8, 8, 64)     36928       max_pooling2d_74[0][0]           
__________________________________________________________________________________________________
conv2d_79 (Conv2D)              (None, 8, 8, 64)     36928       max_pooling2d_78[0][0]           
__________________________________________________________________________________________________
conv2d_83 (Conv2D)              (None, 8, 8, 64)     36928       max_pooling2d_82[0][0]           
__________________________________________________________________________________________________
conv2d_87 (Conv2D)              (None, 8, 8, 64)     36928       max_pooling2d_86[0][0]           
__________________________________________________________________________________________________
conv2d_91 (Conv2D)              (None, 8, 8, 64)     36928       max_pooling2d_90[0][0]           
__________________________________________________________________________________________________
conv2d_95 (Conv2D)              (None, 8, 8, 64)     36928       max_pooling2d_94[0][0]           
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 4, 4, 64)     0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_7 (MaxPooling2D)  (None, 4, 4, 64)     0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_11 (MaxPooling2D) (None, 4, 4, 64)     0           conv2d_11[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_15 (MaxPooling2D) (None, 4, 4, 64)     0           conv2d_15[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_19 (MaxPooling2D) (None, 4, 4, 64)     0           conv2d_19[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_23 (MaxPooling2D) (None, 4, 4, 64)     0           conv2d_23[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_27 (MaxPooling2D) (None, 4, 4, 64)     0           conv2d_27[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_31 (MaxPooling2D) (None, 4, 4, 64)     0           conv2d_31[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_35 (MaxPooling2D) (None, 4, 4, 64)     0           conv2d_35[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_39 (MaxPooling2D) (None, 4, 4, 64)     0           conv2d_39[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_43 (MaxPooling2D) (None, 4, 4, 64)     0           conv2d_43[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_47 (MaxPooling2D) (None, 4, 4, 64)     0           conv2d_47[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_51 (MaxPooling2D) (None, 4, 4, 64)     0           conv2d_51[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_55 (MaxPooling2D) (None, 4, 4, 64)     0           conv2d_55[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_59 (MaxPooling2D) (None, 4, 4, 64)     0           conv2d_59[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_63 (MaxPooling2D) (None, 4, 4, 64)     0           conv2d_63[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_67 (MaxPooling2D) (None, 4, 4, 64)     0           conv2d_67[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_71 (MaxPooling2D) (None, 4, 4, 64)     0           conv2d_71[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_75 (MaxPooling2D) (None, 4, 4, 64)     0           conv2d_75[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_79 (MaxPooling2D) (None, 4, 4, 64)     0           conv2d_79[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_83 (MaxPooling2D) (None, 4, 4, 64)     0           conv2d_83[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_87 (MaxPooling2D) (None, 4, 4, 64)     0           conv2d_87[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_91 (MaxPooling2D) (None, 4, 4, 64)     0           conv2d_91[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_95 (MaxPooling2D) (None, 4, 4, 64)     0           conv2d_95[0][0]                  
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 96, 4, 64)    0           max_pooling2d_3[0][0]            
                                                                 max_pooling2d_7[0][0]            
                                                                 max_pooling2d_11[0][0]           
                                                                 max_pooling2d_15[0][0]           
                                                                 max_pooling2d_19[0][0]           
                                                                 max_pooling2d_23[0][0]           
                                                                 max_pooling2d_27[0][0]           
                                                                 max_pooling2d_31[0][0]           
                                                                 max_pooling2d_35[0][0]           
                                                                 max_pooling2d_39[0][0]           
                                                                 max_pooling2d_43[0][0]           
                                                                 max_pooling2d_47[0][0]           
                                                                 max_pooling2d_51[0][0]           
                                                                 max_pooling2d_55[0][0]           
                                                                 max_pooling2d_59[0][0]           
                                                                 max_pooling2d_63[0][0]           
                                                                 max_pooling2d_67[0][0]           
                                                                 max_pooling2d_71[0][0]           
                                                                 max_pooling2d_75[0][0]           
                                                                 max_pooling2d_79[0][0]           
                                                                 max_pooling2d_83[0][0]           
                                                                 max_pooling2d_87[0][0]           
                                                                 max_pooling2d_91[0][0]           
                                                                 max_pooling2d_95[0][0]           
__________________________________________________________________________________________________
flatten (Flatten)               (None, 24576)        0           concatenate[0][0]                
__________________________________________________________________________________________________
dense (Dense)                   (None, 100)          2457700     flatten[0][0]                    
__________________________________________________________________________________________________
dropout (Dropout)               (None, 100)          0           dense[0][0]                      
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 50)           5050        dropout[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 50)           0           dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 3)            153         dropout_1[0][0]                  
==================================================================================================
Total params: 4,133,303
Trainable params: 4,133,303
Non-trainable params: 0
__________________________________________________________________________________________________
