
layer_1_INCEPT_Net

__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            (None, 128, 128, 17) 0                                            
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 128, 128, 17) 0           input_2[0][0]                    
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 128, 128, 128 2304        input_2[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 128, 128, 64) 9856        input_2[0][0]                    
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 128, 128, 32) 13632       input_2[0][0]                    
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 128, 128, 32) 576         max_pooling2d[0][0]              
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 128, 128, 256 0           conv2d[0][0]                     
                                                                 conv2d_1[0][0]                   
                                                                 conv2d_2[0][0]                   
                                                                 conv2d_3[0][0]                   
==================================================================================================
Total params: 26,368
Trainable params: 26,368
Non-trainable params: 0
__________________________________________________________________________________________________

layer_2_INCEPT_Net

__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_29 (InputLayer)           (None, 32, 32, 256)  0                                            
__________________________________________________________________________________________________
input_27 (InputLayer)           (None, 32, 32, 32)   0                                            
__________________________________________________________________________________________________
input_28 (InputLayer)           (None, 32, 32, 32)   0                                            
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 32, 32, 256)  0           input_29[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 32, 32, 128)  32896       input_29[0][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 32, 32, 64)   18496       input_27[0][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 32, 32, 32)   25632       input_28[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 32, 32, 32)   8224        max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 32, 32, 256)  0           conv2d_4[0][0]                   
                                                                 conv2d_5[0][0]                   
                                                                 conv2d_6[0][0]                   
                                                                 conv2d_7[0][0]                   
==================================================================================================
Total params: 85,248
Trainable params: 85,248
Non-trainable params: 0
__________________________________________________________________________________________________

layer_3_INCEPT_Net

__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_32 (InputLayer)           (None, 10, 32, 256)  0                                            
__________________________________________________________________________________________________
input_30 (InputLayer)           (None, 10, 32, 32)   0                                            
__________________________________________________________________________________________________
input_31 (InputLayer)           (None, 10, 32, 32)   0                                            
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 10, 32, 256)  0           input_32[0][0]                   
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 10, 32, 128)  32896       input_32[0][0]                   
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 10, 32, 64)   18496       input_30[0][0]                   
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 10, 32, 32)   25632       input_31[0][0]                   
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 10, 32, 32)   8224        max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 10, 32, 256)  0           conv2d_8[0][0]                   
                                                                 conv2d_9[0][0]                   
                                                                 conv2d_10[0][0]                  
                                                                 conv2d_11[0][0]                  
==================================================================================================
Total params: 85,248
Trainable params: 85,248
Non-trainable params: 0
__________________________________________________________________________________________________

layer_4_INCEPT_Net

__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_35 (InputLayer)           (None, 5, 5, 256)    0                                            
__________________________________________________________________________________________________
input_33 (InputLayer)           (None, 5, 5, 64)     0                                            
__________________________________________________________________________________________________
input_34 (InputLayer)           (None, 5, 5, 64)     0                                            
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 5, 5, 256)    0           input_35[0][0]                   
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 5, 5, 128)    32896       input_35[0][0]                   
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 5, 5, 64)     36928       input_33[0][0]                   
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 5, 5, 32)     51232       input_34[0][0]                   
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 5, 5, 32)     8224        max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 5, 5, 256)    0           conv2d_12[0][0]                  
                                                                 conv2d_13[0][0]                  
                                                                 conv2d_14[0][0]                  
                                                                 conv2d_15[0][0]                  
==================================================================================================
Total params: 129,280
Trainable params: 129,280
Non-trainable params: 0
__________________________________________________________________________________________________
